[
  {
    "quote": "The entire process of waiting for your guide to issue a notice for the process and then coming to college for just submitting one certificate was so hectic and AVLOKAN saved me from all the hassle. Kudos and a lot of thanks to the AVLOKAN team",
    "name": "Deepti Saini",
    "title": "Btech,Mechanical"
  },
  {
    "quote": "Ever since AVLOKAN launched, submitting NPTEL certificates have been really easy. Loved the optimization of physical time, effort, travel and travel cost too. Looking forward to have it included in various other registrations as welll that can save manual effort!",
    "name": "Shivangi Prasad",
    "title": "Btech,MAC"
  },
  {
    "quote": "I've never seen a team as quick, committed, and student-friendly as AVLOKAN. Even at 11 PM, my doubts were resolved with full clarity and care. They saved me from unnecessary travel by digitizing the entire certification process. What usually takes weeks was done in days. Thank You Team AVLOKAN.",
    "name": "Saurav Upadhaya",
    "title": "Mtech, CSE"
  },
  {
    "quote": "With the introduction of AVLOKAN and NPTEL online submissions, the effort and struggle of individuals in completing offline submissions have significantly reduced. It has streamlined the process, saved time, and made submissions more accessible and efficient, especially for students managing multiple academic responsibilities and deadlines.",
    "name": "Kashish",
    "title": "Btech, ICE"
  },
  {
    "quote": "AVLOKAN has streamlined the NPTEL certificate submission and verification process efficiently. I especially appreciated the prompt and clear query support, which made the experience smooth and far better than the earlier manual system.",
    "name": "Priya Gupta",
    "title": "Mtech, CSE"
  },
  {
    "quote": "The website offers a smooth and efficient certificate submission process with a clean and user-friendly interface. It's easy to navigate and gets the job done in just a few simple steps. The fast response time adds to the overall convenience. A short and hassle-free experience that's easy to handle for everyone.",
    "name": "Sahil Yadav",
    "title": "Btech, CSE"
  },
  {
    "quote": "Uploading certificates was surprisingly simple and fast. The site’s layout is intuitive, making the process smooth even without instructions. It felt effortless and saved valuable time.",
    "name": "Maanya Meena",
    "title": "Btech, IT"
  },
  {
    "quote": "The certificate submission process was quick and seamless. The interface is clean, easy to use, and the steps are clearly guided. It made the whole experience smooth and time-saving.",
    "name": "Lakshika Malik",
    "title": "Btech, IT"
  },
  {
    "quote": "AVLOKAN NSUT is a much-needed platform for students like me who've often faced challenges in submitting NPTEL certificates. I had a smooth, user-friendly experience while using the website, and I'm thankful to the AVLOKAN team for providing this one-stop solution platform.",
    "name": "Nikita Prasad",
    "title": "Mechanical Engineering"
  },
  {
    "quote": "Absolutely seamless experience! It took only 10 seconds to finish the task, kudos to the team who made this possible! It's a portal that saved our hours of travelling just to submit a certificate. It was much needed and we finally got one. Great work really!",
    "name": "Himanshi Sharma",
    "title": "Btech, CSE"
  },
  {
    "quote": "The process for submission of NPTEL certificate this year was very smooth. We simply submitted the soft copy over the website which was absolutely hassle free for us, required no physical reporting, was very safe and quick at the same time.",
    "name": "Ananya",
    "title": "Btech, EIOT"
  },
  {
    "quote": "AVLOKAN NSUT is a much-needed platform for students like me. As a day scholar, I spend nearly two hours traveling to college. Having to go all the way just to submit a physical copy of the NPTEL certificate felt like a waste of time, especially when the same can be done online. With AVLOKAN, I was able to submit my certificate easily from home.",
    "name": "Sameer Ansari",
    "title": "Btech, ECE"
  }
]
